finvoice/test.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd">
<SOAP-ENV:Header>
<eb:MessageHeader xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" SOAP-ENV:mustUnderstand="1">
<eb:From>
<eb:PartyId></eb:PartyId>
<eb:Role>Sender</eb:Role>
</eb:From>
<eb:From>
<eb:PartyId></eb:PartyId>
<eb:Role>Intermediator</eb:Role>
</eb:From>
<eb:To>
<eb:PartyId></eb:PartyId>
<eb:Role>Receiver</eb:Role>
</eb:To>
<eb:To>
<eb:PartyId></eb:PartyId>
<eb:Role>Intermediator</eb:Role>
</eb:To>
<eb:CPAId>yoursandmycpa</eb:CPAId>
<eb:Service>Routing</eb:Service>
<eb:Action>ProcessInvoice</eb:Action>
<eb:MessageData>
<eb:MessageId>1001</eb:MessageId>
<eb:Timestamp></eb:Timestamp>
</eb:MessageData>
</eb:MessageHeader>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<eb:Manifest eb:id="Manifest" eb:version="2.0">
<eb:Reference eb:id="Finvoice" xlink:href="1002">
<eb:schema eb:location="http://www.pankkiyhdistys.fi/verkkolasku/finvoice/finvoice.xsd" eb:version="2.0" />
</eb:Reference>
</eb:Manifest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
<?xml version="1.0" encoding="iso-8859-15"?>
<!DOCTYPE Finvoice SYSTEM "Finvoice.dtd">
<?xml-stylesheet type="text/xsl" href="Finvoice.xsl"?>
<Finvoice Version="1.2">
  <SellerPartyDetails>
    <SellerPartyIdentifier>123456-7</SellerPartyIdentifier>
    <SellerOrganisationName>Test organization</SellerOrganisationName>
    <SellerOrganisationTaxCode>123456-7</SellerOrganisationTaxCode>
    <SellerPostalAddressDetails>
      <SellerStreetName></SellerStreetName>
      <SellerTownName></SellerTownName>
      <SellerPostCodeIdentifier></SellerPostCodeIdentifier>
      <CountryCode>FI</CountryCode>
      <CountryName>Finland</CountryName>
    </SellerPostalAddressDetails>
  </SellerPartyDetails>
  <SellerContactPersonName>Mark Stanley</SellerContactPersonName>
  <SellerCommunicationDetails>
    <SellerPhoneNumberIdentifier></SellerPhoneNumberIdentifier>
    <SellerEmailaddressIdentifier></SellerEmailaddressIdentifier>
  </SellerCommunicationDetails>
  <SellerInformationDetails>
    <SellerHomeTownName></SellerHomeTownName>
    <SellerVatRegistrationText></SellerVatRegistrationText>
    <SellerPhoneNumber></SellerPhoneNumber>
    <SellerFaxNumber></SellerFaxNumber>
    <SellerCommonEmailaddressIdentifier></SellerCommonEmailaddressIdentifier>
    <SellerWebaddressIdentifier></SellerWebaddressIdentifier>
    <SellerFreeText></SellerFreeText>
    <SellerAccountDetails>
      <SellerAccountID IdentificationSchemeName="IBAN"></SellerAccountID>
      <SellerBic IdentificationSchemeName="BIC"></SellerBic>
    </SellerAccountDetails>
  </SellerInformationDetails>
  <BuyerPartyDetails>
    <BuyerPartyIdentifier></BuyerPartyIdentifier>
    <BuyerOrganisationName></BuyerOrganisationName>
    <BuyerOrganisationTaxCode></BuyerOrganisationTaxCode>
    <BuyerPostalAddressDetails>
      <BuyerStreetName></BuyerStreetName>
      <BuyerTownName></BuyerTownName>
      <BuyerPostCodeIdentifier></BuyerPostCodeIdentifier>
      <CountryName></CountryName>
    </BuyerPostalAddressDetails>
  </BuyerPartyDetails>
  <BuyerContactPersonName></BuyerContactPersonName>
  <BuyerCommunicationDetails>
    <BuyerPhoneNumberIdentifier></BuyerPhoneNumberIdentifier>
    <BuyerEmailaddressIdentifier></BuyerEmailaddressIdentifier>
  </BuyerCommunicationDetails>
  <InvoiceDetails>
    <InvoiceTypeCode></InvoiceTypeCode>
    <InvoiceTypeText></InvoiceTypeText>
    <OriginCode></OriginCode>
    <InvoiceNumber>1001</InvoiceNumber>
    <InvoiceDate Format="CCYYMMDD">20130719</InvoiceDate>
    <SellerReferenceIdentifier></SellerReferenceIdentifier>
    <OrderIdentifier></OrderIdentifier>
    <InvoiceTotalVatExcludedAmount AmountCurrencyIdentifier="EUR">400,00</InvoiceTotalVatExcludedAmount>
    <InvoiceTotalVatAmount AmountCurrencyIdentifier="EUR">96,00</InvoiceTotalVatAmount>
    <InvoiceTotalVatIncludedAmount AmountCurrencyIdentifier="EUR">496,00</InvoiceTotalVatIncludedAmount>
    <VatSpecificationDetails>
      <VatBaseAmount AmountCurrencyIdentifier="EUR">400,00</VatBaseAmount>
      <VatRatePercent>24</VatRatePercent>
      <VatRateAmount AmountCurrencyIdentifier="EUR">96,00</VatRateAmount>
    </VatSpecificationDetails>
    <PaymentTermsDetails>
      <PaymentTermsFreeText></PaymentTermsFreeText>
      <InvoiceDueDate Format="CCYYMMDD">20130802</InvoiceDueDate>
      <PaymentOverDueFineDetails>
        <PaymentOverDueFineFreeText></PaymentOverDueFineFreeText>
        <PaymentOverDueFinePercent></PaymentOverDueFinePercent>
      </PaymentOverDueFineDetails>
    </PaymentTermsDetails>
  </InvoiceDetails>
  <PaymentStatusDetails>
    <PaymentStatusCode></PaymentStatusCode>
  </PaymentStatusDetails>
  <VirtualBankBarcode></VirtualBankBarcode>
  <InvoiceRow>
    <ArticleIdentifier></ArticleIdentifier>
    <ArticleName>Test item from API</ArticleName>
    <DeliveredQuantity QuantityUnitCode="pcs">5</DeliveredQuantity>
    <OrderedQuantity QuantityUnitCode="pcs">5</OrderedQuantity>
    <UnitPriceAmount AmountCurrencyIdentifier="EUR" UnitPriceUnitCode="pcs">80,00</UnitPriceAmount>
    <RowNormalProposedAccountIdentifier></RowNormalProposedAccountIdentifier>
    <RowAccountDimensionText></RowAccountDimensionText>
    <RowVatRatePercent>24,00</RowVatRatePercent>
    <RowVatAmount AmountCurrencyIdentifier="EUR">96,00</RowVatAmount>
    <RowVatExcludedAmount AmountCurrencyIdentifier="EUR">400,00</RowVatExcludedAmount>
    <RowAmount AmountCurrencyIdentifier="EUR">496,00</RowAmount>
  </InvoiceRow>
  <SpecificationDetails />
  <EpiDetails>
    <EpiIdentificationDetails>
      <EpiDate Format="CCYYMMDD">20130719</EpiDate>
      <EpiReference></EpiReference>
    </EpiIdentificationDetails>
    <EpiPartyDetails>
      <EpiBfiPartyDetails>
        <EpiBfiIdentifier IdentificationSchemeName="BIC"></EpiBfiIdentifier>
      </EpiBfiPartyDetails>
      <EpiBeneficiaryPartyDetails>
        <EpiNameAddressDetails></EpiNameAddressDetails>
        <EpiBei></EpiBei>
        <EpiAccountID IdentificationSchemeName="IBAN"></EpiAccountID>
      </EpiBeneficiaryPartyDetails>
    </EpiPartyDetails>
    <EpiPaymentInstructionDetails>
      <EpiPaymentInstructionId>1001</EpiPaymentInstructionId>
      <EpiRemittanceInfoIdentifier IdentificationSchemeName="SPY"></EpiRemittanceInfoIdentifier>
      <EpiInstructedAmount AmountCurrencyIdentifier="EUR"></EpiInstructedAmount>
      <EpiCharge ChargeOption="SHA"></EpiCharge>
      <EpiDateOptionDate Format="CCYYMMDD"></EpiDateOptionDate>
    </EpiPaymentInstructionDetails>
  </EpiDetails>
</Finvoice>
